Revit 2027 API
NurbsSurfaceData.GetKnotsV Method
 Get the list of knots in the v-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetKnotsV()
Public Function GetKnotsV As IList(Of Double)
public:
IList<double>^ GetKnotsV()
member GetKnotsV : unit -> IList<float>
Return Value
IList<Double>
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace